Filip83/ecos-devel/ecos-3.0/packages/devs/usb/kinetis/current/src/usbc_khci_kinetis.c
//==========================================================================
//
//      usbs_kci_kinetis.c
//
//      Driver for the Freescale Kinetis USB device
//
//==========================================================================
// ####ECOSGPLCOPYRIGHTBEGIN####
// -------------------------------------------
// This file is part of eCos, the Embedded Configurable Operating System.
// Copyright (C) 2006, 2010 Free Software Foundation, Inc.
//
// eCos is free software; you can redistribute it and/or modify it under
// the terms of the GNU General Public License as published by the Free
// Software Foundation; either version 2 or (at your option) any later
// version.
//
// eCos is distributed in the hope that it will be useful, but WITHOUT
// ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
// FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
// for more details.
//
// You should have received a copy of the GNU General Public License
// along with eCos; if not, write to the Free Software Foundation, Inc.,
// 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
//
// As a special exception, if other files instantiate templates or use
// macros or inline functions from this file, or you compile this file
// and link it with other works to produce a work based on this file,
// this file does not by itself cause the resulting work to be covered by
// the GNU General Public License. However the source code for this file
// must still be made available in accordance with section (3) of the GNU
// General Public License v2.
//
// This exception does not invalidate any other reasons why a work based
// on this file might be covered by the GNU General Public License.
// -------------------------------------------
// ####ECOSGPLCOPYRIGHTEND####
//==========================================================================
//#####DESCRIPTIONBEGIN####
//
// Author(s):    Filip,
// Contributors: 
// Date:         2017-04-20
//
// This code implements support for the on-chip USB port on the Freescale
// Kinetis family of processors.
//
//####DESCRIPTIONEND####
//==========================================================================

#include <pkgconf/hal.h>
#include <pkgconf/devs_usb_kinetis.h>
#include <pkgconf/system.h>

#include <cyg/hal/hal_io.h>
#include <cyg/hal/hal_if.h>
#include <cyg/hal/hal_intr.h>
#include <cyg/hal/drv_api.h>
#include <cyg/hal/hal_cache.h>

#include <cyg/io/usb/usb.h>
#include <cyg/io/usb/usbs.h>
#include <cyg/io/usb/usbs_kinetis.h>

#include "usb_hdr.h"

#include <cyg/infra/cyg_type.h>
#include <cyg/infra/cyg_ass.h>
#include <cyg/infra/cyg_trac.h>
#include <cyg/infra/diag.h>
#include <string.h>

#if 1



#define UDC_BSS(x)               __attribute__((__aligned__(x)))

#define USB_DEVICE_EP_CTRL_SIZE    8


//Kci configration macros
#define USB_DEVICE_CONFIG_LOW_POWER_MODE            1
#define USB_DEVICE_CONFIG_KHCI_ERROR_HANDLING       1
#define USB_DEVICE_CONFIG_DETACH_ENABLE             0
#define FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED    0
#define USB_DEVICE_CHARGER_DETECT_ENABLE            0
#define FSL_FEATURE_SOC_USBDCD_COUNT                0
#define USB_DEVICE_CONFIG_REMOTE_WAKEUP             0
#define FSL_FEATURE_USB_KHCI_OTG_ENABLED            0
#define USB_DEVICE_CONFIG_OTG                       0
#define FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED     0
#define USB_DEVICE_CONFIG_KEEP_ALIVE_MODE           0
#define FSL_FEATURE_USB_KHCI_USB_RAM                0
#define FSL_FEATURE_USB_KHCI_IRC48M_MODULE_CLOCK_ENABLED 1


// ecos Interrupt objects
static cyg_interrupt usbs_kinetis_intr_data;
static cyg_handle_t  usbs_kinetis_intr_handle;

static cyg_interrupt usbs_plug_intr_data;
static cyg_handle_t  usbs_plug_intr_handle;

// Driver API functions
static void usbs_kinetis_ep0_start(usbs_control_endpoint *);
static void usbs_kinetis_poll(usbs_control_endpoint *);

static void usbs_kinetis_endpoint_start(usbs_rx_endpoint * pep);
static void usbs_kinetis_endpoint_set_halted(usbs_rx_endpoint * pep,
                                          cyg_bool new_value);

static void
usbs_state_notify (usbs_control_endpoint * pcep);

 usbs_control_return
usbs_kinetis_control_setup_get_status(void);
 
  usbs_control_return
usbs_kinetis_control_setup_get_status(void);
  
  usbs_control_return
usbs_kinetis_control_setup();

usb_status_t USB_DeviceKhciCancel(usb_device_khci_state_struct_t *khciState, cyg_uint8 ep);

//Endpoints control banks buffer
UDC_BSS(512) static cyg_uint8 s_UsbDeviceKhciBdtBuffer[1][512U];

// Driver data sructrue
usb_device_khci_state_struct_t kinetis_usb_device =
{
    bdt:                        &s_UsbDeviceKhciBdtBuffer,
    registerBase:               USB0,
    dmaAlignBuffer:             NULL,
    isDmaAlignBufferInusing:    0,
    isResetting:                0,
    controllerId:               0,
};

// Endpoint 0, the control endpoint, structure.
usbs_control_endpoint ep0 = {
    // The hardware does not distinguish  between detached, attached and powered.
    state:                  USBS_STATE_POWERED,
    enumeration_data:       (usbs_enumeration_data *) 0,
    start_fn:               usbs_kinetis_ep0_start,
    poll_fn:                usbs_kinetis_poll,
    interrupt_vector:       CYGNUM_HAL_INTERRUPT_USB0,
    control_buffer:         {0, 0, 0, 0, 0, 0, 0, 0},
    state_change_fn:        (void (*) (usbs_control_endpoint *,
                                       void *, usbs_state_change, int)) 0,
    state_change_data:      (void *) 0,
    standard_control_fn:    (usbs_control_return (*)
                            (usbs_control_endpoint *, void *)) 0,
    standard_control_data:  (void *) 0,
    class_control_fn:       (usbs_control_return (*)
                             (usbs_control_endpoint *, void *)) 0,
    class_control_data:     (void *) 0,
    vendor_control_fn:      (usbs_control_return (*)
                             (usbs_control_endpoint *, void *)) 0,
    vendor_control_data:    (void *) 0,
    reserved_control_fn:    (usbs_control_return (*)
                             (usbs_control_endpoint *, void *)) 0,
    reserved_control_data:  (void *) 0,
    buffer:                 (unsigned char *) 0,
    buffer_size:            0,
    fill_buffer_fn:         (void (*)(usbs_control_endpoint *)) 0,
    fill_data:              (void *) 0,
    fill_index:             0,
    complete_fn:            (usbs_control_return (*)(usbs_control_endpoint *,
                                                     int)) 0
};

// Endpoint 1 receive control structure
usbs_rx_endpoint ep1 = {
    start_rx_fn:    usbs_kinetis_endpoint_start,
    set_halted_fn:  usbs_kinetis_endpoint_set_halted,
    complete_fn:    (void (*)(void *, int)) 0,
    complete_data:  (void *) 0,
    buffer:         (unsigned char *) 0,
    buffer_size:    0,
    halted:         0,
};

// Endpoint 2 Receive control structure
usbs_rx_endpoint ep2 = {
    start_rx_fn:    usbs_kinetis_endpoint_start,
    set_halted_fn:  usbs_kinetis_endpoint_set_halted,
    complete_fn:    (void (*)(void *, int)) 0,
    complete_data:  (void *) 0,
    buffer:         (unsigned char *) 0,
    buffer_size:    0,
    halted:         0,
};

