Filip83/ecos-devel/ecos-3.0/packages/devs/usb/kinetis/current/src/usbc_khci_kinetis.c
// Endpoint 3 Receive control structure
usbs_rx_endpoint ep3 = {
    start_rx_fn:    usbs_kinetis_endpoint_start,
    set_halted_fn:  usbs_kinetis_endpoint_set_halted,
    complete_fn:    (void (*)(void *, int)) 0,
    complete_data:  (void *) 0,
    buffer:         (unsigned char *) 0,
    buffer_size:    0,
    halted:         0,
};

#if (CYGNUM_DEVS_USB_KINETIS_CONFIG_ENDPOINTS > 4)
// Endpoint 4 Receive control structure
usbs_rx_endpoint ep4 = {
    start_rx_fn:    usbs_kinetis_endpoint_start,
    set_halted_fn:  usbs_kinetis_endpoint_set_halted,
    complete_fn:    (void (*)(void *, int)) 0,
    complete_data:  (void *) 0,
    buffer:         (unsigned char *) 0,
    buffer_size:    0,
    halted:         0,
};
#endif

#if (CYGNUM_DEVS_USB_KINETIS_CONFIG_ENDPOINTS > 5)
// Endpoint 5 Receive control structure
usbs_rx_endpoint ep5 = {
    start_rx_fn:    usbs_kinetis_endpoint_start,
    set_halted_fn:  usbs_kinetis_endpoint_set_halted,
    complete_fn:    (void (*)(void *, int)) 0,
    complete_data:  (void *) 0,
    buffer:         (unsigned char *) 0,
    buffer_size:    0,
    halted:         0,
};
#endif

#if (CYGNUM_DEVS_USB_KINETIS_CONFIG_ENDPOINTS > 6)
// Endpoint 6 Receive control structure
usbs_rx_endpoint ep6 = {
    start_rx_fn:    usbs_kinetis_endpoint_start,
    set_halted_fn:  usbs_kinetis_endpoint_set_halted,
    complete_fn:    (void (*)(void *, int)) 0,
    complete_data:  (void *) 0,
    buffer:         (unsigned char *) 0,
    buffer_size:    0,
    halted:         0,
};
#endif

#if (CYGNUM_DEVS_USB_KINETIS_CONFIG_ENDPOINTS > 7)
// Endpoint 7 Receive control structure
usbs_rx_endpoint ep7 = {
    start_rx_fn:    usbs_kinetis_endpoint_start,
    set_halted_fn:  usbs_kinetis_endpoint_set_halted,
    complete_fn:    (void (*)(void *, int)) 0,
    complete_data:  (void *) 0,
    buffer:         (unsigned char *) 0,
    buffer_size:    0,
    halted:         0,
};
#endif

// Array of end points. Used for translating end point pointer to an
// end point number
static const void *usbs_kinetis_endpoints[CYGNUM_DEVS_USB_KINETIS_CONFIG_ENDPOINTS] = {
  (void *) &ep0,
  (void *) &ep1,
  (void *) &ep2,
  (void *) &ep3
#if (CYGNUM_DEVS_USB_KINETIS_CONFIG_ENDPOINTS > 4)
  ,(void *) &ep4, (void *) &ep5
#if (CYGNUM_DEVS_USB_KINETIS_CONFIG_ENDPOINTS > 6)
  ,(void *) &ep6, (void *) &ep7
#endif
#endif
};

// Convert an endpoint pointer to an endpoint number, using the array
// of endpoint structures
static int
usbs_kinetis_pep_to_number(const usbs_rx_endpoint * pep)
{
    int epn;

    for(epn=0; epn < CYGNUM_DEVS_USB_KINETIS_CONFIG_ENDPOINTS; epn++) {
        if (pep == usbs_kinetis_endpoints[epn])
            return epn;
    }
    CYG_FAIL("Unknown endpoint");
    return 0;
}

/******************************************************************************
 *   Mofidifed kci USB driver routines from NXP source.                       *
 ******************************************************************************/

/*!
 * @brief Write the BDT to start a transfer.
 *
 * The function is used to start a transfer by writing the BDT.
 *
 * @param khciState       Pointer of the device KHCI state structure.
 * @param endpoint         Endpoint number.
 * @param direction        The direction of the endpoint, 0U - USB_OUT, 1U - USB_IN.
 * @param buffer           The memory address to save the received data, or the memory address to hold the data need to
 * be sent.
 * @param length           The length of the data.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceKhciEndpointTransfer(
        usb_device_khci_state_struct_t *khciState, cyg_uint8 endpoint, 
        cyg_uint8 direction, cyg_uint8 *buffer, cyg_uint32 length)
{
    cyg_uint32 index = ((cyg_uint32)endpoint << 1U) | (cyg_uint32)direction;
    cyg_uint32 irq;

    /* Enter critical */
    HAL_DISABLE_INTERRUPTS(irq);

    /* Flag the endpoint is busy. */
    khciState->endpointState[index].stateUnion.stateBitField.transferring = 1U;

    /* Add the data buffer address to the BDT. */
    USB_KHCI_BDT_SET_ADDRESS((cyg_uint32)khciState->bdt, endpoint, direction,
                khciState->endpointState[index].stateUnion.stateBitField.bdtOdd, 
                (cyg_uint32)buffer);

    /* Change the BDT control field to start the transfer. */
    USB_KHCI_BDT_SET_CONTROL((cyg_uint32)khciState->bdt, endpoint, direction,
            khciState->endpointState[index].stateUnion.stateBitField.bdtOdd,
            USB_LONG_TO_LITTLE_ENDIAN(USB_KHCI_BDT_BC(length) | 
                                      USB_KHCI_BDT_OWN        | 
                                      USB_KHCI_BDT_DTS        |
            USB_KHCI_BDT_DATA01(khciState->endpointState[index].stateUnion.stateBitField.data0)));

    /* Exit critical */
    HAL_RESTORE_INTERRUPTS(irq);

    /* Clear the token busy state */
    khciState->registerBase->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;
    return kStatus_USB_Success;
}

/*!
 * @brief Prime a next setup transfer.
 *
 * The function is used to prime a buffer in control out pipe to wait for receiving the host's setup packet.
 *
 * @param khciState       Pointer of the device KHCI state structure.
 *
 */
static void USB_DeviceKhciPrimeNextSetup(usb_device_khci_state_struct_t *khciState)
{
/* Update the endpoint state */
/* Save the buffer address used to receive the setup packet. */
#if defined(FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED) && (FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED > 0U) && \
    defined(USB_DEVICE_CONFIG_KEEP_ALIVE_MODE) && (USB_DEVICE_CONFIG_KEEP_ALIVE_MODE > 0U) &&             \
    defined(FSL_FEATURE_USB_KHCI_USB_RAM) && (FSL_FEATURE_USB_KHCI_USB_RAM > 0U)
    /* In case of lowpower mode enabled, it requires to put the setup packet buffer(16 bytes) into the USB RAM so
     * that the setup packet would wake up the USB.
     */
    khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_OUT].transferBuffer =
        (cyg_uint8 *)(khciState->bdt + 0x200U - 0x10U) +
        khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_OUT].stateUnion.stateBitField.bdtOdd *
            USB_SETUP_PACKET_SIZE;
#else
    khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_OUT].transferBuffer =
        (cyg_uint8 *)&khciState->setupPacketBuffer[0] +
        khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_OUT].stateUnion.stateBitField.bdtOdd *
            USB_SETUP_PACKET_SIZE;
#endif
    /* Clear the transferred length. */
    khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_OUT].transferDone = 0U;
    /* Save the data length expected to get from a host. */
    khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_OUT].transferLength = USB_SETUP_PACKET_SIZE;
    /* Save the data buffer DMA align flag. */
    khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_OUT].stateUnion.stateBitField.dmaAlign = 1U;
    /* Set the DATA0/1 to DATA0. */
    khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_OUT].stateUnion.stateBitField.data0 = 0U;

    USB_DeviceKhciEndpointTransfer(khciState, USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL, USB_OUT,
                                   khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_OUT].transferBuffer,
                                   USB_SETUP_PACKET_SIZE);
}

/*!
 * @brief Set device controller state to default state.
 *
 * The function is used to set device controller state to default state.
 * The function will be called when USB_DeviceKhciInit called or the control type kUSB_DeviceControlGetEndpointStatus
 * received in USB_DeviceKhciControl.
 *
 * @param khciState       Pointer of the device KHCI state structure.
 *
 */
static void USB_DeviceKhciSetDefaultState(usb_device_khci_state_struct_t *khciState)
{
    cyg_uint8 interruptFlag;
    cyg_uint8 count;

