Filip83/ecos-devel/ecos-3.0/packages/devs/usb/kinetis/current/src/usbc_khci_kinetis.c
 }
 
 cyg_uint32
usbs_kinetis_isr (cyg_vector_t vector, cyg_addrword_t data)
{
    cyg_uint8 status;
    usb_device_khci_state_struct_t *khciState;
    CYG_ASSERT(CYGNUM_HAL_INTERRUPT_USB0 == vector, "USB ISR should only be invoked for USB interrupts");
    //CYG_ASSERT(0 == data, "The Kinetis ISR needs no global data pointer");
    
    khciState = (usb_device_khci_state_struct_t *)data;

    intr_status = khciState->registerBase->ISTAT;
    status = intr_status;
    diag_printf("%d\n",status);
    cyg_drv_interrupt_acknowledge(vector);

#if defined(FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED) && (FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED > 0U) && \
    defined(USB_DEVICE_CONFIG_KEEP_ALIVE_MODE) && (USB_DEVICE_CONFIG_KEEP_ALIVE_MODE > 0U) &&             \
    defined(FSL_FEATURE_USB_KHCI_USB_RAM) && (FSL_FEATURE_USB_KHCI_USB_RAM > 0U)
    /* Clear EEP_ALIVE_CTRL_WAKE_INT interrupt state */
    if (khciState->registerBase->KEEP_ALIVE_CTRL & USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_MASK)
    {
        khciState->registerBase->KEEP_ALIVE_CTRL |= USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_MASK;
    }
    /* Clear SOFTOK interrupt state */
    if (khciState->registerBase->ISTAT & USB_ISTAT_SOFTOK_MASK)
    {
        khciState->registerBase->ISTAT = USB_ISTAT_SOFTOK_MASK;
    }
#endif
#if defined(USB_DEVICE_CONFIG_KHCI_ERROR_HANDLING) && (USB_DEVICE_CONFIG_KHCI_ERROR_HANDLING > 0U)
    /* Error interrupt */
    if (status & kUSB_KhciInterruptError)
    {
        diag_printf("Error isr\n");
        USB_DeviceKhciInterruptError(khciState);
    }
#endif /* USB_DEVICE_CONFIG_KHCI_ERROR_HANDLING */
    /* Token done interrupt */
    if (status & kUSB_KhciInterruptTokenDone)
    {
        //diag_printf("Token isr\n");
        USB_DeviceKhciInterruptTokenDone(khciState);
    }

    /* Reset interrupt */
    if (status & kUSB_KhciInterruptReset)
    {
        diag_printf("Reset isr\n");
        usb_device_endpoint_init_struct_t initStr;
        USB_DeviceKhciInterruptReset(khciState);
         
    }

#if (defined(USB_DEVICE_CONFIG_LOW_POWER_MODE) && (USB_DEVICE_CONFIG_LOW_POWER_MODE > 0U))
    /* Suspend interrupt */
    if (status & kUSB_KhciInterruptSleep)
    {
        diag_printf("Slep isr\n");
        USB_DeviceKhciInterruptSleep(khciState);
    }

    /* Resume interrupt */
    if (status & kUSB_KhciInterruptResume)
    {
        diag_printf("Resume isr\n");
        USB_DeviceKhciInterruptResume(khciState);
    }

    if (khciState->registerBase->USBTRC0 & USB_USBTRC0_USB_RESUME_INT_MASK)
    {
        diag_printf("Resume isr2\n");
        USB_DeviceKhciInterruptResume(khciState);
    }
#endif /* USB_DEVICE_CONFIG_LOW_POWER_MODE */

    /* Endpoint stalled interrupt */
    if (status & kUSB_KhciInterruptStall)
    {
        diag_printf("Stall isr\n");
        USB_DeviceKhciInterruptStall(khciState);
    }

#if (defined(USB_DEVICE_CONFIG_DETACH_ENABLE) && (USB_DEVICE_CONFIG_DETACH_ENABLE > 0U)) && \
    (defined(FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED) && (FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED > 0U))
    if (khciState->registerBase->USBTRC0 & USB_USBTRC0_VREDG_DET_MASK)
    {
        USB_DeviceKhciInterruptVbusRising(khciState);
    }

    if (khciState->registerBase->USBTRC0 & USB_USBTRC0_VFEDG_DET_MASK)
    {
        USB_DeviceKhciInterruptVbusFalling(khciState);
    }
#endif /* USB_DEVICE_CONFIG_DETACH_ENABLE && FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED */

#if 0U
    /* Sof token interrupt */
    if (status & kUSB_KhciInterruptSofToken)
    {
        USB_DeviceKhciInterruptSof(khciState);
    }
#endif

#if ((defined FSL_FEATURE_USB_KHCI_IRC48M_MODULE_CLOCK_ENABLED) && \
     (FSL_FEATURE_USB_KHCI_IRC48M_MODULE_CLOCK_ENABLED > 0U))
    status = khciState->registerBase->CLK_RECOVER_INT_STATUS;
    if (status)
    {
        /* USB RECOVER interrupt is happenned */
        if (USB_CLK_RECOVER_INT_STATUS_OVF_ERROR_MASK & status)
        {
            /* Indicates that the USB clock recovery algorithm has detected that the frequency trim adjustment needed
             * for the IRC48M output clock is outside the available TRIM_FINE adjustment range for the IRC48M
             * module.
             */
            CYG_ASSERT(false,"IRC48M Error.\n");
        }
        khciState->registerBase->CLK_RECOVER_INT_STATUS = status;
    }
#endif
    
    //cyg_drv_interrupt_unmask(vector);
    
    return CYG_ISR_HANDLED;
}

 /******************************************************************************
 *   Device API routines.                                                      *
 ******************************************************************************/
 // Start endpoint reception/trasmitrion
void
usbs_kinetis_endpoint_start (usbs_rx_endpoint * pep)
{
    const usb_endpoint_descriptor *usb_endpoints;
    int epn = usbs_kinetis_pep_to_number(pep);
    usb_endpoints = ep0.enumeration_data->endpoints;
    cyg_uint8 epAddress = usb_endpoints[epn].endpoint;

    CYG_ASSERT (pep->complete_fn, "No complete_fn()");

    cyg_drv_dsr_lock ();
    if (ep0.state != USBS_STATE_CONFIGURED) {
        /* If not configured it means there is nothing to do */
        cyg_drv_dsr_unlock ();

        if (pep->complete_fn) {
            (*pep->complete_fn) (pep->complete_data, -EPIPE);
        }
        return;
    }

    // Is this endpoint currently stalled? If so then a size of 0 can
    // be used to block until the stall condition is clear, anything
    // else should result in an immediate callback.
    if (pep->halted) {
        /* Halted means nothing to do */
        cyg_drv_dsr_unlock ();

        if (pep->complete_fn && pep->buffer_size != 0) {
            (*pep->complete_fn) (pep->complete_data, -EAGAIN);
        }
        return;
    }
    
    // Request next transfer
    if((epAddress&0x80) == USB_ENDPOINT_DESCRIPTOR_ENDPOINT_IN)
    {
        USB_DeviceKhciSend(&kinetis_usb_device,epAddress,pep->buffer,pep->buffer_size);
    }
    else if((epAddress&0x80) == USB_ENDPOINT_DESCRIPTOR_ENDPOINT_OUT)
    {
        USB_DeviceKhciRecv(&kinetis_usb_device,epAddress,pep->buffer,pep->buffer_size);
    }
    else
    {
        if (pep->complete_fn) {
            (*pep->complete_fn) (pep->complete_data, -EIO);
        }
    }

    cyg_drv_dsr_unlock ();
}

// Stall or UnStall specifed endpoint
void
usbs_kinetis_endpoint_set_halted (usbs_rx_endpoint * pep, cyg_bool new_value)
{
    const usb_endpoint_descriptor *usb_endpoints;
    int epn = usbs_kinetis_pep_to_number(pep);
    usb_endpoints = ep0.enumeration_data->endpoints;
    cyg_uint8 epAddress = usb_endpoints[epn].endpoint;
    
