Filip83/ecos-devel/ecos-3.0/packages/devs/usb/kinetis/current/src/usbc_khci_kinetis.c
    usb_endpoints = ep0.enumeration_data->endpoints;

    cyg_drv_dsr_lock ();

    if (pep->halted != new_value) {
        /* There is something is to do */
        pep->halted = new_value;

        if ( new_value ) 
        {
            /* Halt endpoint */
            // TODO: je to blbe protoze funkce pozaduje i informaci o smeru
            USB_DeviceKhciEndpointStall(&kinetis_usb_device,epAddress);

        } else 
        {
            // TODO: je to blbe protoze funkce pozaduje i informaci o smer
            USB_DeviceKhciEndpointUnstall(&kinetis_usb_device,epAddress);
            // Ready to use
            if (pep->complete_fn) {
              (*pep->complete_fn) (pep->complete_data, ENOERR);
             }
        }
    }
    cyg_drv_dsr_unlock ();
}

// Init all used edpoints
void usbs_ep_alloc(void)
{
    int epn;
    const usb_endpoint_descriptor *usb_endpoints;

    // Now walk the endpoints configuring them correctly. This only
    // works if there is one interface.
    usb_endpoints = ep0.enumeration_data->endpoints;

    for (epn = 0;
    epn < ep0.enumeration_data->total_number_endpoints;
    epn++) 
    {
        usb_device_endpoint_init_struct_t initStr;
        
        initStr.maxPacketSize = ((cyg_uint32)usb_endpoints[epn].max_packet_lo |
                            ((cyg_uint32)usb_endpoints[epn].max_packet_hi << 8));
    
        initStr.endpointAddress = usb_endpoints[epn].endpoint;
        initStr.transferType    = usb_endpoints[epn].attributes;
        
        USB_DeviceKhciControl(&kinetis_usb_device,
                kUSB_DeviceControlEndpointInit,&initStr);
    }
}

// Start endpoint 0
void
usbs_kinetis_ep0_start (usbs_control_endpoint * endpoint)
{
    usb_device_endpoint_init_struct_t initStr;
    initStr.endpointAddress = 0;
    initStr.maxPacketSize   = 8;
    initStr.transferType    = 0;
    initStr.zlt             = 0;

    USB_DeviceKhciControl(&kinetis_usb_device,
            kUSB_DeviceControlEndpointInit,&initStr);
    
    initStr.endpointAddress = 0x80;
    USB_DeviceKhciControl(&kinetis_usb_device,
            kUSB_DeviceControlEndpointInit,&initStr);
    
    USB_DeviceKhciControl(&kinetis_usb_device,
        kUSB_DeviceControlRun,&initStr);
}

// ----------------------------------------------------------------------------
// Initialization
//
// This routine gets called from a prioritized static constructor during
// eCos startup.
// ----------------------------------------------------------------------------
// Initialization
//
// This routine gets called from a prioritized static constructor during
// eCos startup.
/*!
 * @brief Initialize the USB device KHCI instance.
 *
 * This function initizlizes the USB device KHCI module specified by the controllerId.
 *
 * @param controllerId The controller id of the USB IP. Please refer to enumeration type usb_controller_index_t.
 * @param handle        Pointer of the device handle, used to identify the device object is belonged to.
 * @param khciHandle   It is out parameter, is used to return pointer of the device KHCI handle to the caller.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
void usbs_kinetis_init (void)
{
    usb_device_khci_state_struct_t *khciState = &kinetis_usb_device;

    CYGHWR_IO_CLOCK_ENABLE(CYGHWR_HAL_KINETIS_SIM_SCGC_USBOTG);
    
    // Reste USB
    khciState->registerBase->USBTRC0 = 0x80;
    while(khciState->registerBase->USBTRC0 & 0x80)
    {
        
    }
    
    #if ((defined FSL_FEATURE_USB_KHCI_IRC48M_MODULE_CLOCK_ENABLED) && \
     (FSL_FEATURE_USB_KHCI_IRC48M_MODULE_CLOCK_ENABLED > 0U))
    khciState->registerBase->CLK_RECOVER_IRC_EN = 3;
    khciState->registerBase->CLK_RECOVER_CTRL = 0x80;
    #endif
    
    /* Clear all interrupt flags. */
    khciState->registerBase->ISTAT = 0xFFU;

#if (defined(USB_DEVICE_CONFIG_OTG) && (USB_DEVICE_CONFIG_OTG))
    khciState->otgStatus = 0U;
#else
    /* Disable the device functionality. */
    USB_DeviceKhciControl(khciState, kUSB_DeviceControlStop, NULL);
#endif

    /* Set BDT buffer address */
    khciState->registerBase->BDTPAGE1 = (cyg_uint8)((((cyg_uint32)khciState->bdt) >> 8U) & 0xFFU);
    khciState->registerBase->BDTPAGE2 = (cyg_uint8)((((cyg_uint32)khciState->bdt) >> 16U) & 0xFFU);
    khciState->registerBase->BDTPAGE3 = (cyg_uint8)((((cyg_uint32)khciState->bdt) >> 24U) & 0xFFU);

#if (defined(USB_DEVICE_CONFIG_DETACH_ENABLE) && (USB_DEVICE_CONFIG_DETACH_ENABLE > 0U)) && \
    (defined(FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED) && (FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED > 0U))
    khciState->registerBase->MISCCTRL |= USB_MISCCTRL_VREDG_EN_MASK | USB_MISCCTRL_VFEDG_EN_MASK;
#endif

#if defined(FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED) && (FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED > 0U) && \
    defined(USB_DEVICE_CONFIG_KEEP_ALIVE_MODE) && (USB_DEVICE_CONFIG_KEEP_ALIVE_MODE > 0U) &&             \
    defined(FSL_FEATURE_USB_KHCI_USB_RAM) && (FSL_FEATURE_USB_KHCI_USB_RAM > 0U)
    khciState->registerBase->CLK_RECOVER_CTRL |= USB_CLK_RECOVER_CTRL_CLOCK_RECOVER_EN_MASK;
    khciState->registerBase->KEEP_ALIVE_CTRL =
        USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN_MASK | USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN_MASK |
        USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_MASK | FSL_FEATURE_USB_KHCI_KEEP_ALIVE_MODE_CONTROL;
    /* wake on out and setup transaction */
    khciState->registerBase->KEEP_ALIVE_WKCTRL = 0x1U;
#if defined(FSL_FEATURE_SOC_MCGLITE_COUNT) && (FSL_FEATURE_SOC_MCGLITE_COUNT > 0U)
    MCG->MC |= MCG_MC_HIRCLPEN_MASK;
#endif
    PMC->REGSC |= PMC_REGSC_BGEN_MASK | PMC_REGSC_VLPO_MASK;
#endif
    /* Set KHCI device state to default value. */
    USB_DeviceKhciSetDefaultState(khciState);
    
    //usbs_ep_alloc();

    // TODO set interrupt priority properly
    cyg_drv_interrupt_create (CYGNUM_HAL_INTERRUPT_USB0,
                            0x10,  
                            khciState,  // data
                            &usbs_kinetis_isr,
                            &usbs_kinetis_dsr,
                            &usbs_kinetis_intr_handle, 
                            &usbs_kinetis_intr_data);

    cyg_drv_interrupt_attach (usbs_kinetis_intr_handle);
    
    ep0.state = USBS_STATE_POWERED;
    usbs_state_notify (&ep0);
    cyg_drv_interrupt_acknowledge(CYGNUM_HAL_INTERRUPT_USB0);
    cyg_drv_interrupt_unmask(CYGNUM_HAL_INTERRUPT_USB0);
}

// There has been a change in state. Update the end point.
static void
usbs_state_notify (usbs_control_endpoint * pcep)
{
    static int old_state = USBS_STATE_CHANGE_POWERED;
    int i;
    int state = pcep->state & USBS_STATE_MASK;

    if (pcep->state != old_state) {
        diag_printf("notify\n");
        /*USB_DeviceKhciControl(&kinetis_usb_device,
                kUSB_DeviceControlSetDefaultStatus,NULL);*/
        
        switch (state) {
            case USBS_STATE_DETACHED:
            case USBS_STATE_ATTACHED:
            case USBS_STATE_POWERED:
                // Nothing to do
                break;
            case USBS_STATE_DEFAULT:
                break;
            case USBS_STATE_ADDRESSED:
                diag_printf("Addr\n");
                usbs_ep_alloc();
                break;
            case USBS_STATE_CONFIGURED:
                break;
            default:
                CYG_FAIL("Unknown endpoint state");
        }

        if (pcep->state_change_fn) {
            (*pcep->state_change_fn) (pcep, pcep->state_change_data,
                                                    pcep->state, old_state);
        }

        old_state = pcep->state;
    }
}

